{
    "terms": {
        "last_updated": "Last Updated: November 23, 2024",
        "sections": {
            "agreement": {
                "title": "1. Terms Agreement",
                "content": "By using this service (hereinafter \"Service\"), you are deemed to agree to these terms and related policies (including Privacy Policy). If you do not agree, you cannot use this Service."
            },
            "service": {
                "title": "2. Service Provision",
                "content": [
                    "CoreMatrix AI (hereinafter \"Company\") provides workforce matching and project consulting services.",
                    "While the Company strives for service continuity and accuracy, service may be interrupted or delayed, and the Company bears no legal responsibility for such occurrences.",
                    "All responsibility for developer matching, project results, and performance lies with the contract between clients and developers."
                ]
            },
            "obligations": {
                "title": "3. User Obligations",
                "content": [
                    "Users must provide accurate and up-to-date information. Service use may be restricted if false information is provided.",
                    "Users must not engage in illegal or unethical activities through the Service.",
                    "Users must not infringe on others' rights and must comply with all laws and regulations."
                ]
            },
            "liability": {
                "title": "4. Limitation of Liability",
                "content": [
                    "The Company is not liable for indirect, incidental, or punitive damages arising from service provision.",
                    "Contracts and communication between clients and developers are solely the responsibility of the parties involved. The Company acts only as an intermediary.",
                    "The Company is not responsible for force measure situations such as technical issues, data loss, or service interruptions."
                ]
            },
            "intellectual_property": {
                "title": "5. Intellectual Property Rights",
                "content": [
                    "All materials provided by the Company (text, images, logos, code, etc.) are Company property and may not be reproduced, distributed, or modified without prior written consent.",
                    "Users may not commercially use information provided through this Service."
                ]
            },
            "disputes": {
                "title": "6. Dispute Resolution",
                "content": [
                    "These terms are interpreted according to the laws of the Republic of Korea.",
                    "The Seoul Central District Court shall have jurisdiction as the court of first instance for all disputes."
                ]
            },
            "changes": {
                "title": "7. Changes to Terms",
                "content": "The Company reserves the right to modify these terms at any time, and changes take effect immediately upon posting to the website. Users must discontinue Service use if they do not agree to the modified terms."
            },
            "contact": {
                "title": "8. Contact",
                "content": "Please contact us at the following for inquiries:",
                "email": "corematrixai@gmail.com"
            }   
        }
    }
}   